<bug id='3986' author='cardshuffle' open_date='2016-08-23T14:51:48Z' closed_time='2017-02-06T22:56:40Z'>
	<summary>Freeze graph: node is not in graph (even though it's been named)</summary>
	<description>
&lt;denchmark-h:h3&gt;Environment info&lt;/denchmark-h&gt;

Operating System: Ubuntu 14.04 LTS 64-bit
Installed version of CUDA and cuDNN: none
If installed from source, provide

The commit hash (git rev-parse HEAD): fc91629
The output of bazel version

&lt;denchmark-code&gt;Build label: 0.3.0
Build target: bazel-out/local-fastbuild/bin/src/main/java/com/google/devtools/build/lib/bazel/BazelServer_deploy.jar
Build time: Fri Jun 10 11:38:23 2016 (1465558703)
Build timestamp: 1465558703
Build timestamp as int: 1465558703
&lt;/denchmark-code&gt;

&lt;denchmark-h:h3&gt;Steps to reproduce&lt;/denchmark-h&gt;


Copy the IPython Notebook for Assignment 6 of Udacity's deep learning course (here)
Change saved_sample_output = tf.Variable(tf.zeros([1, num_nodes])) to saved_sample_output = tf.Variable(tf.zeros([1, num_nodes]), name="saved_sample_output")
Modify the code like so:

with tf.Session(graph=graph) as session:
  tf.initialize_all_variables().run()
  print('Initialized')
  mean_loss = 0
  # code omitted (no changes)
  # new code below:
  saver = tf.train.Saver(tf.all_variables())
  saver.save(session, '/home/me/Documents/checkpoint.ckpt', write_meta_graph=False)
  tf.train.write_graph(graph.as_graph_def(), '/home/me/Documents', 'graph.pb')

Run.
Verify that checkpoint.ckpt and graph.pb have been successfully created in the directory.
In the tensorflow source directory, run:

&lt;denchmark-code&gt;bazel build tensorflow/python/tools:freeze_graph &amp;&amp; bazel-bin/tensorflow/python/tools/freeze_graph --input_graph=/home/me/Documents/graph.pb --input_checkpoint=/home/me/Documents/checkpoint.ckpt --output_graph=/home/me/Documents/frozen_graph.pb --output_node_names=saved_sample_output
&lt;/denchmark-code&gt;

&lt;denchmark-h:h3&gt;What have you tried?&lt;/denchmark-h&gt;

Checked the graph.pb file to make sure that node had actually been named properly. Seems like it was:
&lt;denchmark-code&gt;# other stuff
node {
  name: "saved_sample_output"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
# etc.
&lt;/denchmark-code&gt;

I'm pretty much stumped with this one since &lt;denchmark-link:https://stackoverflow.com/questions/38958662/tensorflow-what-are-the-output-node-names-for-freeze-graph-py-in-the-model-wi&gt;this&lt;/denchmark-link&gt;
 issue on StackOverflow says to pass in a name parameter for the node you want, which is what I did, to no avail (even without the name parameter, it still gave the same error).
 Got freeze_graph to run successfully with the  node (changed  to ). However, I still haven't figured out why that worked, and this didn't.
&lt;denchmark-h:h3&gt;Logs or other output that would be helpful&lt;/denchmark-h&gt;

&lt;denchmark-code&gt;Traceback (most recent call last):
  File "/home/me/tf_m/tensorflow/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/tools/freeze_graph.py", line 134, in &lt;module&gt;
    tf.app.run()
  File "/home/me/tf_m/tensorflow/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/platform/app.py", line 30, in run
    sys.exit(main(sys.argv))
  File "/home/me/tf_m/tensorflow/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/tools/freeze_graph.py", line 131, in main
    FLAGS.output_graph, FLAGS.clear_devices, FLAGS.initializer_nodes)
  File "/home/me/tf_m/tensorflow/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/tools/freeze_graph.py", line 120, in freeze_graph
    sess, input_graph_def, output_node_names.split(","))
  File "/home/me/tf_m/tensorflow/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/framework/graph_util.py", line 232, in convert_variables_to_constants
    inference_graph = extract_sub_graph(input_graph_def, output_node_names)
  File "/home/me/tf_m/tensorflow/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/framework/graph_util.py", line 156, in extract_sub_graph
    assert d in name_to_node_map, "%s is not in graph" % d
AssertionError: saved_sample_output is not in graph
&lt;/denchmark-code&gt;

	</description>
	<comments>
		<comment id='1' author='cardshuffle' date='2016-10-03T07:39:54Z'>
		I meet the similar issue.
		</comment>
		<comment id='2' author='cardshuffle' date='2017-01-16T20:16:25Z'>
		&lt;denchmark-link:https://github.com/petewarden&gt;@petewarden&lt;/denchmark-link&gt;
 I get the same error when I try to freeze_graph.py. I would appreciate if you could help me with this:
WARNING: /home/pouyanj/.cache/bazel/_bazel_pouyanj/0e1d84e60e1e91548f16e1302589059b/external/protobuf/protobuf.bzl:90:19: Variables HOST_CFG and DATA_CFG are deprecated in favor of strings "host" and "data" correspondingly.
WARNING: /home/pouyanj/.cache/bazel/_bazel_pouyanj/0e1d84e60e1e91548f16e1302589059b/external/protobuf/protobuf.bzl:96:28: Variables HOST_CFG and DATA_CFG are deprecated in favor of strings "host" and "data" correspondingly.
WARNING: /home/pouyanj/.cache/bazel/_bazel_pouyanj/0e1d84e60e1e91548f16e1302589059b/external/gemmlowp/BUILD:102:12: in hdrs attribute of cc_library rule @gemmlowp//:eight_bit_int_gemm: Artifact 'external/gemmlowp/profiling/instrumentation.h' is duplicated (through '@gemmlowp//:eight_bit_int_gemm_public_headers' and '@gemmlowp//:gemmlowp_headers').
WARNING: /home/pouyanj/.cache/bazel/_bazel_pouyanj/0e1d84e60e1e91548f16e1302589059b/external/gemmlowp/BUILD:102:12: in hdrs attribute of cc_library rule @gemmlowp//:eight_bit_int_gemm: Artifact 'external/gemmlowp/profiling/profiler.h' is duplicated (through '@gemmlowp//:eight_bit_int_gemm_public_headers' and '@gemmlowp//:gemmlowp_headers').
WARNING: /home/pouyanj/.cache/bazel/_bazel_pouyanj/0e1d84e60e1e91548f16e1302589059b/external/gemmlowp/BUILD:102:12: in hdrs attribute of cc_library rule @gemmlowp//:eight_bit_int_gemm: Artifact 'external/gemmlowp/public/bit_depth.h' is duplicated (through '@gemmlowp//:eight_bit_int_gemm_public_headers' and '@gemmlowp//:gemmlowp_headers').
WARNING: /home/pouyanj/.cache/bazel/_bazel_pouyanj/0e1d84e60e1e91548f16e1302589059b/external/gemmlowp/BUILD:102:12: in hdrs attribute of cc_library rule @gemmlowp//:eight_bit_int_gemm: Artifact 'external/gemmlowp/public/gemmlowp.h' is duplicated (through '@gemmlowp//:eight_bit_int_gemm_public_headers' and '@gemmlowp//:gemmlowp_headers').
WARNING: /home/pouyanj/.cache/bazel/_bazel_pouyanj/0e1d84e60e1e91548f16e1302589059b/external/gemmlowp/BUILD:102:12: in hdrs attribute of cc_library rule @gemmlowp//:eight_bit_int_gemm: Artifact 'external/gemmlowp/public/map.h' is duplicated (through '@gemmlowp//:eight_bit_int_gemm_public_headers' and '@gemmlowp//:gemmlowp_headers').
WARNING: /home/pouyanj/.cache/bazel/_bazel_pouyanj/0e1d84e60e1e91548f16e1302589059b/external/gemmlowp/BUILD:102:12: in hdrs attribute of cc_library rule @gemmlowp//:eight_bit_int_gemm: Artifact 'external/gemmlowp/public/output_stages.h' is duplicated (through '@gemmlowp//:eight_bit_int_gemm_public_headers' and '@gemmlowp//:gemmlowp_headers').
INFO: Found 1 target...
Target //tensorflow/python/tools:freeze_graph up-to-date:
bazel-bin/tensorflow/python/tools/freeze_graph
INFO: Elapsed time: 7.444s, Critical Path: 0.20s
Traceback (most recent call last):
File "/home/pouyanj/Desktop/tensorflow-r0.11/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/tools/freeze_graph.py", line 134, in 
tf.app.run()
File "/home/pouyanj/Desktop/tensorflow-r0.11/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/platform/app.py", line 30, in run
sys.exit(main(sys.argv[:1] + flags_passthrough))
File "/home/pouyanj/Desktop/tensorflow-r0.11/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/tools/freeze_graph.py", line 131, in main
FLAGS.output_graph, FLAGS.clear_devices, FLAGS.initializer_nodes)
File "/home/pouyanj/Desktop/tensorflow-r0.11/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/tools/freeze_graph.py", line 120, in freeze_graph
sess, input_graph_def, output_node_names.split(","))
File "/home/pouyanj/Desktop/tensorflow-r0.11/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/framework/graph_util.py", line 234, in convert_variables_to_constants
inference_graph = extract_sub_graph(input_graph_def, output_node_names)
File "/home/pouyanj/Desktop/tensorflow-r0.11/bazel-bin/tensorflow/python/tools/freeze_graph.runfiles/org_tensorflow/tensorflow/python/framework/graph_util.py", line 158, in extract_sub_graph
assert d in name_to_node_map, "%s is not in graph" % d
AssertionError: softmax is not in graph
		</comment>
		<comment id='3' author='cardshuffle' date='2017-01-20T23:26:38Z'>
		Me too!
		</comment>
		<comment id='4' author='cardshuffle' date='2017-01-24T22:26:20Z'>
		&lt;denchmark-link:https://github.com/kevinashaw&gt;@kevinashaw&lt;/denchmark-link&gt;
 just to be sure, did you check on ?
		</comment>
		<comment id='5' author='cardshuffle' date='2017-01-27T18:12:11Z'>
		Ping anyone?
		</comment>
		<comment id='6' author='cardshuffle' date='2017-02-06T22:56:40Z'>
		Closing due to lack of response.
		</comment>
		<comment id='7' author='cardshuffle' date='2017-05-02T16:04:43Z'>
		Hi all,
I am getting this error
&lt;denchmark-code&gt;in extract_sub_graph
    assert d in name_to_node_map, "%s is not in graph" % d
AssertionError: predictions is not in graph,

&lt;/denchmark-code&gt;

what that mean sub graph?
I am sure that the name of my output is correct,
this is my code for freezing:
&lt;denchmark-code&gt;dir = os.path.dirname(os.path.realpath(__file__))
tf.train.write_graph(sess.graph_def, '/home/saria/Downloads/sentiment_analysis_tensorflow-master', 'har.pbtxt')
saver.save(sess,save_path = "../har.ckpt")

freeze_graph.freeze_graph(input_graph = "../har.pbtxt",  input_saver = "",
             input_binary = False, input_checkpoint = "../har.ckpt", output_node_names = "predictions",
             restore_op_name = "save/restore_all", filename_tensor_name = "save/Const:0",
             output_graph = "frozen_har.pb", clear_devices = True, initializer_nodes = "")

input_graph_def = tf.GraphDef()

&lt;/denchmark-code&gt;

may please some one help with this problem, I am get stuck in this error no ways for getting the right answer
		</comment>
		<comment id='8' author='cardshuffle' date='2017-05-29T09:43:05Z'>
		@saria85
Write the graph as a text file using as_text=True in write_graph.
Open the graph file, it will have some node entries written in plane text.
Check the node name you are passing is in the graph file. When I had the same problem, the actual node name had some extra parts on the end.
		</comment>
		<comment id='9' author='cardshuffle' date='2018-02-23T07:06:14Z'>
		Bro check you node nameing convention. . . Naming of "matmul function to output" and "x placeholder to input". . .
		</comment>
		<comment id='10' author='cardshuffle' date='2018-02-25T04:17:39Z'>
		&lt;denchmark-link:https://github.com/SanthoshMKunthe&gt;@SanthoshMKunthe&lt;/denchmark-link&gt;
 Is there any possible to print all the node name in Graph? Checked the code and didn't find anything about the naming you mentioned. Thanks!
		</comment>
		<comment id='11' author='cardshuffle' date='2018-02-25T04:27:06Z'>
		Use json viewer. . . It helped me to solve mis naming problem. . . Its one of the solution, look for other possibilities to be sure. . .
		</comment>
		<comment id='12' author='cardshuffle' date='2018-02-25T04:42:56Z'>
		I used this function to get all the node names, but more than 10000 nodes are really crazy for me to figure out the one that belong to me......  print(len([n.name for n in tf.get_default_graph().as_graph_def().node]))
		</comment>
		<comment id='13' author='cardshuffle' date='2018-04-11T12:24:53Z'>
		yes, the node name is incorrect according to the .pb file, you have to print the actual name used during the saving by print model.output.op.name same with input if that happened occasionally model.input.op.name, then you can use the printed name as an argument in the export function.
i hope this solved the problem.
		</comment>
		<comment id='14' author='cardshuffle' date='2018-07-12T13:03:44Z'>
		@moss-khaldi how did you print the output node name while saving? It isn't available for estimators using the access method you've mentioned (model,output.op.name).
		</comment>
		<comment id='15' author='cardshuffle' date='2018-07-12T13:14:54Z'>
		&lt;denchmark-link:https://github.com/iamgroot42&gt;@iamgroot42&lt;/denchmark-link&gt;
 Hi, after the building of the network use  and by  i mean the name of the model you have used, i'd like to mention too that the methods i've used is concerned of the Keras API, so if you're using TensorFlow you may want to search for the appropriate function to display the names of the nodes.
		</comment>
		<comment id='16' author='cardshuffle' date='2018-07-12T13:38:25Z'>
		Oh. Keras wasn't mentioned in your comments anywhere; I assumed it's for Estimator.
		</comment>
		<comment id='17' author='cardshuffle' date='2018-07-12T13:45:12Z'>
		Sorry, i just cleared my answer 😊.
		</comment>
		<comment id='18' author='cardshuffle' date='2019-02-11T12:54:40Z'>
		I met similar issue, even after i print out all the node name by using print([node.name for node in graph.as_graph_def().node]) and chose a name from them, the freeze_graph.py still return AssertionError: MobileNet/Predictions/Softmax is not in graph
		</comment>
		<comment id='19' author='cardshuffle' date='2019-03-06T12:07:16Z'>
		I got the same error, then when I printed the node names using
out_names = [x.op.name for x in model.outputs] I got u'activation_1_1/Sigmoid' as a name but it did not work.
Then I searched in the generated tmp.pb file for Sigmoid and the name I found is "activation_1/Sigmoid".
I used it and it worked!
		</comment>
		<comment id='20' author='cardshuffle' date='2019-06-25T06:14:47Z'>
		&lt;denchmark-link:https://github.com/YoussefBenDhieb&gt;@YoussefBenDhieb&lt;/denchmark-link&gt;
 how did you search  in tmp.pb , can you please tell step by step.
		</comment>
		<comment id='21' author='cardshuffle' date='2019-06-25T10:06:43Z'>
		&lt;denchmark-link:https://github.com/dassi25&gt;@dassi25&lt;/denchmark-link&gt;
 You open the tmp.pb file using an editor like Sublime or Visual Studio Code and you search for the name of the activation, in my case it is Sigmoid. Also, I had only one sigmoid activation in the graph, but even if you have many, usually it will be the last one.
		</comment>
		<comment id='22' author='cardshuffle' date='2019-07-06T05:04:47Z'>
		I faced the same problem, and the  command saved me. (&lt;denchmark-link:https://www.tensorflow.org/guide/saved_model&gt;https://www.tensorflow.org/guide/saved_model&lt;/denchmark-link&gt;
)
So if you are in a linux environment and has tensorflow installed, you can enter the following command.
saved_model_cli show --dir ./ --all
of course, use the directory path of yours
It will show something like below:
&lt;denchmark-code&gt;outputs['output'] tensor_info:
    dtype: DT_FLOAT
    shape: (-1, 512)
    name: some/kind/of/tensor/Add:0
&lt;/denchmark-code&gt;

Then your name should be some/kind/of/tensor/Add without the numbering
		</comment>
		<comment id='23' author='cardshuffle' date='2019-12-24T01:15:15Z'>
		Just in case - I found the eager execution caused my problem.
		</comment>
		<comment id='24' author='cardshuffle' date='2020-04-14T10:50:44Z'>
		Hi all,
In my network, I make name of node with 'name = 'prob' as code below
self.prob_output_layer = tf.nn.softmax(self.output_layer, name='prob')
--&gt; and we expect that node name should be 'prob'
But we need to check the file.pb
node {
name: "dnn_01/Softmax"
op: "Softmax"
input: "dnn_01/fully_layer03/fully_layer03/Add_1"
device: "/device:GPU:0"
attr {
key: "T"
value {
type: DT_FLOAT
}
}
}
--&gt; We found that node name is 'dnn_01/Softmax'
Therefore, we need use 'dnn_01/Softmax' name when freezing
		</comment>
		<comment id='25' author='cardshuffle' date='2020-08-17T11:15:24Z'>
		TF 2.3, my issue got solved by
&lt;denchmark-code&gt;import tensorflow.compat.v1 as tf
tf.disable_v2_behavior()
&lt;/denchmark-code&gt;

I have no idea why this works.
Explanation is welcome.
		</comment>
		<comment id='26' author='cardshuffle' date='2020-08-31T07:37:42Z'>
		I had the error, but my problem was that I was iterating over the tf.GraphDef.node and modifying that list at the same time (inserting and removing nodes) so be careful not to do that
		</comment>
		<comment id='27' author='cardshuffle' date='2020-09-29T07:27:04Z'>
		
I faced the same problem, and the saved_model_cli command saved me. (https://www.tensorflow.org/guide/saved_model)
So if you are in a linux environment and has tensorflow installed, you can enter the following command.
saved_model_cli show --dir ./ --all
of course, use the directory path of yours
It will show something like below:
outputs['output'] tensor_info:
    dtype: DT_FLOAT
    shape: (-1, 512)
    name: some/kind/of/tensor/Add:0

Then your name should be some/kind/of/tensor/Add without the numbering

I think it's not working in Tensorflow 1.15.2
		</comment>
		<comment id='28' author='cardshuffle' date='2020-10-21T05:26:28Z'>
		
TF 2.3, my issue got solved by
import tensorflow.compat.v1 as tf
tf.disable_v2_behavior()

I have no idea why this works.
Explanation is welcome.

Yah its working thanks
		</comment>
	</comments>
</bug>