<bug id='6640' author='yaroslavvb' open_date='2017-01-04T20:17:25Z' closed_time='2017-01-07T04:46:47Z'>
	<summary>not registered 'TensorArrayV2' on 12.1 on MacOS CPU</summary>
	<description>
I'm getting
tensorflow.python.framework.errors_impl.NotFoundError: Op type not registered 'TensorArrayV2'  after upgrading to 0.12.1 on MacOS. Same code works on 0.11 on Mac and 0.12.1 on Ubuntu CPU
This op seems to be created by dynamic RNN code
&lt;denchmark-code&gt;node {
  name: "global/RNN/TensorArray_1"
  op: "TensorArrayV2"
  input: "global/RNN/strided_slice_2"
  device: "/cpu:0"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "global/RNN/dynamic_rnn/input_0"
    }
  }


&lt;/denchmark-code&gt;

Sorry don't have a shorter repro atm, but a long repro is to follow install instructions on &lt;denchmark-link:https://github.com/openai/universe-starter-agent&gt;https://github.com/openai/universe-starter-agent&lt;/denchmark-link&gt;
 and run it with Mac CPU tensorflow
&lt;denchmark-code&gt;export TF_BINARY_URL=https://storage.googleapis.com/tensorflow/mac/cpu/tensorflow-0.12.1-py3-none-any.whl
pip install -I --upgrade setuptools
pip install --upgrade $TF_BINARY_URL
python train.py --num-workers 2 --env-id PongDeterministic-v3 --log-dir /tmp/pong
&lt;/denchmark-code&gt;

	</description>
	<comments>
		<comment id='1' author='yaroslavvb' date='2017-01-07T04:46:46Z'>
		Closing it for now since low-priority, will reopen with better reproducible example if this comes up again
		</comment>
		<comment id='2' author='yaroslavvb' date='2017-01-07T17:26:22Z'>
		If you rebuild your graph using a newer version of tf Python, it'll point
to the new TensorArray ops.
&lt;denchmark-link:#&gt;…&lt;/denchmark-link&gt;


On Jan 6, 2017 8:47 PM, "Yaroslav Bulatov" ***@***.***&gt; wrote:
 Closed #6640 &lt;#6640&gt;.

 —
 You are receiving this because you were assigned.
 Reply to this email directly, view it on GitHub
 &lt;#6640 (comment)&gt;,
 or mute the thread
 &lt;https://github.com/notifications/unsubscribe-auth/ABtim-6Rb967zkgg4Ie_ruProkicHIRAks5rPxjIgaJpZM4LbBgh&gt;
 .



		</comment>
	</comments>
</bug>