{"BR": {"BR_id": "1079", "BR_author": "kakila", "BRopenT": "2017-08-04T09:39:11Z", "BRcloseT": "2017-08-07T04:56:18Z", "BR_text": {"BRsummary": "confusing dimensions in mlpack_sparse_coding help", "BRdescription": "\n The html help of the CLI <denchmark-link:http://www.mlpack.org/docs/mlpack-2.2.4/man/mlpack_sparse_coding.html>mlpack_sparse_coding</denchmark-link>\n  has an weird description of the shapes and sizes of the decomposition of the data matrix.\n In the current text it seems that a n-by-m matrix is descried as \"a matrix with m things and n other-things\", so columns/rows are inverted in the plain language description. This is confusing, usually you read first the rows then the columns.\n I guess it should read (being consistent with the notation of the mathematical description of the algorithm), [] are optional:\n \n Given a dense [d-by-n] data matrix X with d dimensions and n points, sparse coding seeks to find a dense [d-by-k] dictionary matrix D with k atoms in d dimensions, and a sparse [k-by-n] coding matrix Z with n points in k dimensions.\n \n \t"}, "comments": {"comments_0": {"comment_id": 1, "comment_author": "kakila", "commentT": "2017-08-07T04:56:18Z", "comment_text": "\n \t\tSure, I agree this is a nice improvement.  I committed this simple change in <denchmark-link:https://github.com/mlpack/mlpack/commit/031ac933c7ca3e7e516c863afa7db1158d9cf80a>031ac93</denchmark-link>\n .  Please feel free to send more documentation suggestions in the future; good documentation is really hard to do and the more help we get the better we can make the docs. :)  Thanks!\n \t\t"}, "comments_1": {"comment_id": 2, "comment_author": "kakila", "commentT": "2017-08-07T10:26:33Z", "comment_text": "\n \t\tThanks, the help now is still missing information of what the CSV files should have. Somewhere else in the documentation it si explained that a n-by-d X matrix printed to a CSV file will be read in as a d-by-n. so the help is valid for this transposed matrix, but the user might think they have to actually put that in the CSV, this is not the case.\n A line is needed explaining what the  input is and what the outputs are (options -c and -d). Currently the input is the untransposed n-by-d X matrix, but the outputs (dictionary D and codes Z) are transposed, meaning that $DZ$ cannot be calculated, but $ZD$, i.e. to regenerate X one needs to do $D^\\top Z^\\top$.\n The simple fix is to explin this in the documentation. The better but more complicated (also due to back compatibility) is to fix the outputs D and Z to be compatible with the input\n \t\t"}, "comments_2": {"comment_id": 3, "comment_author": "kakila", "commentT": "2017-08-10T01:23:19Z", "comment_text": "\n \t\tI think the sufficient thing to do here is just to change the documentation to say that  can be recovered by calculating  not .  I made that change in <denchmark-link:https://github.com/mlpack/mlpack/commit/6395726e95fa552fcae3322e6ed780a62ef21d86>6395726</denchmark-link>\n .  Thanks for pointing out the issue. :)\n \t\t"}}}, "commit": {"commit_id": "031ac933c7ca3e7e516c863afa7db1158d9cf80a", "commit_author": "Ryan Curtin", "commitT": "2017-08-07 00:42:59-04:00", "changed_files": {"file_0": {"file_change_type": "MODIFY", "file_Nmethod": 0, "file_old_name": "src\\mlpack\\methods\\sparse_coding\\sparse_coding_main.cpp", "file_new_name": "src\\mlpack\\methods\\sparse_coding\\sparse_coding_main.cpp", "hunks": {"hunk_0": {"Ismethod": 0, "added_lines": "25", "deleted_lines": "25"}}}}}}