{"BR": {"BR_id": "61", "BR_author": "fmikaelian", "BRopenT": "2019-03-04T16:10:51Z", "BRcloseT": "2019-03-05T21:47:23Z", "BR_text": {"BRsummary": "read_squad_examples() does not work with our custom input object", "BRdescription": "\n <denchmark-link:https://github.com/fmikaelian/cdQA/blob/6e26415fe604b70bfb9ba062b555680567a8ea58/cdqa/reader/bertqa_sklearn.py#L125>https://github.com/fmikaelian/cdQA/blob/6e26415fe604b70bfb9ba062b555680567a8ea58/cdqa/reader/bertqa_sklearn.py#L125</denchmark-link>\n \n \t"}, "comments": {"comments_0": {"comment_id": 1, "comment_author": "fmikaelian", "commentT": "2019-03-04T17:40:14Z", "comment_text": "\n \t\tBoth object are <class 'list'>\n I am now exploring the structure of those lists\n \t\t"}, "comments_1": {"comment_id": 2, "comment_author": "fmikaelian", "commentT": "2019-03-05T10:30:40Z", "comment_text": "\n \t\tIt seems it is due to the fact that question and id should be within paragraph'sqas:\n <denchmark-code>{'title': 'Artificial Intelligence: more revolutionary than the Internet!',\n  'paragraphs': [{'context': 'BNP Paribas launches the prototype AGORA, first online community for corporate clients',\n    'qas': [],\n    'question': 'Who is the creator of Artificial Intelligence?',\n    'id': '6c383c98-3f2f-11e9-8649-0242ac110012'},\n   {'context': 'Artificial Intelligence has progressed at lightning speed in recent years. Machines are now able to beat humans in Go matches, understand natural language, reason and learn. As a result, software and robots have something to offer in every field to make business more productive, profitable and innovative. Chronicle of a revolution foretold.',\n    'qas': [],\n    'question': 'Who is the creator of Artificial Intelligence?',\n    'id': '6c383ea0-3f2f-11e9-8649-0242ac110012'},\n   {'context': 'Artificial Intelligence refers to a set of technologies – machine learning, deep learning, language processing, etc. – that share one common feature in that they rely on a computer system capable of analyzing, understanding, learning and discovering connections between things, facts and events as well as manipulating concepts. It should come as no surprise that machines have acquired these extraordinary abilities. Just like flying cars, autonomous and hyper-intelligent humanoid robots have been a major part of science fiction for decades.',\n    'qas': [],\n    'question': 'Who is the creator of Artificial Intelligence?',\n    'id': '6c383f68-3f2f-11e9-8649-0242ac110012'},\n   {'context': '“Artificial Intelligence is a word that has been around for 60 years, but which ultimately refers to nothing more than software. Machines are very good at performing repetitive tasks and can help humans work more efficiently. But they cannot take their own initiatives and can only make progress by interacting with people”, explains Edouard d’Archimbaud, manager of the Data Science & Artificial Intelligence Lab at BNP Paribas CIB. ',\n    'qas': [],\n    'question': 'Who is the creator of Artificial Intelligence?',\n    'id': '6c383ffe-3f2f-11e9-8649-0242ac110012'},\n </denchmark-code>\n \n Compared to:\n <denchmark-code>{'title': 'Super_Bowl_50',\n  'paragraphs': [{'context': 'Super Bowl 50 was an American football game to determine the champion of the National Football League (NFL) for the 2015 season. The American Football Conference (AFC) champion Denver Broncos defeated the National Football Conference (NFC) champion Carolina Panthers 24–10 to earn their third Super Bowl title. The game was played on February 7, 2016, at Levi\\'s Stadium in the San Francisco Bay Area at Santa Clara, California. As this was the 50th Super Bowl, the league emphasized the \"golden anniversary\" with various gold-themed initiatives, as well as temporarily suspending the tradition of naming each Super Bowl game with Roman numerals (under which the game would have been known as \"Super Bowl L\"), so that the logo could prominently feature the Arabic numerals 50.',\n    'qas': [{'answers': [{'answer_start': 177, 'text': 'Denver Broncos'},\n       {'answer_start': 177, 'text': 'Denver Broncos'},\n       {'answer_start': 177, 'text': 'Denver Broncos'}],\n      'question': 'Which NFL team represented the AFC at Super Bowl 50?',\n      'id': '56be4db0acb8001400a502ec'},\n     {'answers': [{'answer_start': 249, 'text': 'Carolina Panthers'},\n       {'answer_start': 249, 'text': 'Carolina Panthers'},\n       {'answer_start': 249, 'text': 'Carolina Panthers'}],\n      'question': 'Which NFL team represented the NFC at Super Bowl 50?',\n      'id': '56be4db0acb8001400a502ed'},\n     ]},\n   {'context': 'The Panthers finished the regular season with a 15–1 record, and quarterback Cam Newton was named the NFL Most Valuable Player (MVP). They defeated the Arizona Cardinals 49–15 in the NFC Championship Game and advanced to their second Super Bowl appearance since the franchise was founded in 1995. The Broncos finished the regular season with a 12–4 record, and denied the New England Patriots a chance to defend their title from Super Bowl XLIX by defeating them 20–18 in the AFC Championship Game. They joined the Patriots, Dallas Cowboys, and Pittsburgh Steelers as one of four teams that have made eight appearances in the Super Bowl.',\n    'qas': [{'answers': [{'answer_start': 77, 'text': 'Cam Newton'},\n       {'answer_start': 77, 'text': 'Cam Newton'},\n       {'answer_start': 77, 'text': 'Cam Newton'}],\n      'question': 'Which Carolina Panthers player was named Most Valuable Player?',\n      'id': '56be4e1facb8001400a502f6'},\n      ...\n </denchmark-code>\n \n \t\t"}}}, "commit": {"commit_id": "d6df5bdc85a56f2ed03d1a76f59ad80bbb139505", "commit_author": "fmikaelian", "commitT": "2019-03-05 14:41:30+01:00", "changed_files": {"file_0": {"file_change_type": "MODIFY", "file_Nmethod": 1, "file_old_name": "cdqa\\utils\\converter.py", "file_new_name": "cdqa\\utils\\converter.py", "hunks": {"hunk_0": {"Ismethod": 1, "added_lines": "51,52,53,54,55", "deleted_lines": "51,52,53,54", "method_info": {"method_name": "generate_squad_examples", "method_params": "question,article_indices,metadata", "method_startline": "39", "method_endline": "58"}}}}}}}