{"BR": {"BR_id": "1552", "BR_author": "tvst", "BRopenT": "2020-06-08T18:48:25Z", "BRcloseT": "2020-06-29T14:47:53Z", "BR_text": {"BRsummary": "File uploader doesn't reset when connection resets", "BRdescription": "\n Steps to repro:\n \n Run a script that has a file uploader and prints the contents of the uploaded file into the app\n Upload a file.\n \n You'll see the file's name in the uploader widget\n You'll see the contents of the file printed in the app\n \n \n Ctrl-C from the Streamlit server BUT don't close the tab\n \n The app will disconnect, but will keep showing the filename and contents\n \n \n Rerun the script from (1)\n \n Expected:\n The app should reconnect, causing the script to rerun, and you should see exactly the same as in step (2) above.\n Actual:\n The app reconnects, causing the script to rerun, but what you see this:\n \n The file's name in the uploader widget (YAY)\n You do not see the contents of the file (SAD FACE)\n \n Why this is happening:\n On the backend, we remove uploaded files from our cache as soon as the corresponding connection closes. This means when the connection is re-established, the file isn't no the server anymore.\n Possible solution:\n \n [P0] Make file uploader re-upload the file when disconnected/reconnected\n \n If files doesn't exist in user machine anymore, reset file-uploader instead so it doesn't show the filename, and doesn't send the file hash.\n \n \n [P1] To avoid reuploading large files too often when in a crappy connection, files in the backend could have a TTL of X minutes after the connection closes. (Which means the frontend needs to know about the TTL too...)\n \n \t"}, "comments": {"comments_0": {"comment_id": 1, "comment_author": "tvst", "commentT": "2020-06-10T23:04:16Z", "comment_text": "\n \t\tThis doesn't seem to occur when the server is stopped and restarted. Need to figure out a way to repro by disconnecting/reconnecting the websocket, perhaps adding a timeout that kills the websocket on the frontend.\n \t\t"}, "comments_1": {"comment_id": 2, "comment_author": "tvst", "commentT": "2020-06-23T18:08:22Z", "comment_text": "\n \t\tThis happens because files are stored by session id + widget id. When the session is disconnected, you get assigned a new session id when reconnected. Since we look up files by session id + widget id, you lose the file data because your new session id has no files associated. However, the widgets themselves maintain the state of the file that was previously uploaded.\n The quick and easy recommended solution is to reset the component when a session is disconnected. We can do this by looking at the disabled prop. This prop changes based on the connection state.\n Not sure if its possible but a larger change could be to try to reconnect to a previous session if one exists. I think this would be a wide reaching change that should be handled separately.\n \t\t"}, "comments_2": {"comment_id": 3, "comment_author": "tvst", "commentT": "2020-06-23T22:58:58Z", "comment_text": "\n \t\tLet's go with the easy fix, since at least it makes the current behavior clearer.\n But please create about making Streamlit better for folks with an intermittent connection. Every time they reconnect they: (1) cause the script to rerun, (2) cause the file uploaded to reset. We should try to come up with a better solution there — although that will require a lot of thought...\n \t\t"}, "comments_3": {"comment_id": 4, "comment_author": "tvst", "commentT": "2020-06-24T15:18:11Z", "comment_text": "\n \t\t<denchmark-link:https://github.com/tvst>@tvst</denchmark-link>\n  created <denchmark-link:https://github.com/streamlit/streamlit/issues/1628>#1628</denchmark-link>\n  to address a global solution for intermittent connections.\n \t\t"}}}, "commit": {"commit_id": "f7576ee2c4c098cd7cb0c0e804bc963a25e86d21", "commit_author": "karrie", "commitT": "2020-06-29 10:47:52-04:00", "changed_files": {"file_0": {"file_change_type": "MODIFY", "file_Nmethod": 0, "file_old_name": "frontend\\src\\components\\widgets\\FileUploader\\FileUploader.test.tsx", "file_new_name": "frontend\\src\\components\\widgets\\FileUploader\\FileUploader.test.tsx", "hunks": {"hunk_0": {"Ismethod": 0, "added_lines": "105,106,107,108,109,110,111,112", "deleted_lines": null}}}, "file_1": {"file_change_type": "MODIFY", "file_Nmethod": 0, "file_old_name": "frontend\\src\\components\\widgets\\FileUploader\\FileUploader.tsx", "file_new_name": "frontend\\src\\components\\widgets\\FileUploader\\FileUploader.tsx", "hunks": {"hunk_0": {"Ismethod": 0, "added_lines": "56,57,58,59,60,61,62,63,64,65,66", "deleted_lines": null}}}}}}