{"BR": {"BR_id": "14455", "BR_author": "cfehr247", "BRopenT": "2017-11-10T15:53:55Z", "BRcloseT": "2017-11-30T01:12:59Z", "BR_text": {"BRsummary": "Tensorflow cannot be installed with default Windows Python 3.5 stack", "BRdescription": "\n After installing Python 3.5.0 using the Windows 64 bit installer (which includes pip in the install):\n pip3 install --upgrade tensorflow\n Collecting tensorflow\n Could not find a version that satisfies the requirement tensorflow (from versions: )\n No matching distribution found for tensorflow\n You are using pip version 7.1.2, however version 9.0.1 is available.\n You should consider upgrading via the 'python -m pip install --upgrade pip' command.\n I tried on a different machine that worked, and found the only difference to be the pip version.  Updating to pip 9.0.1 solved the issue.\n It's not explicitly stated anywhere that you need a newer version of pip.  When an old version of something is required to run something, people tend to ignore the messages indicating there is a newer version of it because that's exactly what they are expecting: \"yeah I know there's a newer version, I meant to do this\".\n If this cannot be resolved for older version of pip (specifically, versions included with the required Python versions), could you please state this in the documentation.\n \t"}, "comments": {"comments_0": {"comment_id": 1, "comment_author": "cfehr247", "commentT": "2017-11-10T21:31:00Z", "comment_text": "\n \t\tIn the PR above, I added a link on the Install Windows docs to include a link to a stack overflow page that covers this.\n \t\t"}}}, "commit": {"commit_id": "2ae9c6c7a20dbd8f05e4b60e921e60986e2968bf", "commit_author": "Austin Anderson", "commitT": "2017-11-13 11:19:44-08:00", "changed_files": {"file_0": {"file_change_type": "MODIFY", "file_Nmethod": 0, "file_old_name": "tensorflow\\docs_src\\install\\install_windows.md", "file_new_name": "tensorflow\\docs_src\\install\\install_windows.md", "hunks": {"hunk_0": {"Ismethod": 0, "added_lines": "87,221,222,223,224,225,226", "deleted_lines": "87,101,224"}}}}}}